---
kind: enumMember
id: F:Autodesk.Revit.DB.StorageType.Integer
enum: Autodesk.Revit.DB.StorageType
source: html/3dbebcb8-792b-a3dd-fe63-faaa05704f3c.htm
---
# Autodesk.Revit.DB.StorageType.Integer

The internal data is stored in the form of a signed 32 bit integer.